app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(page: params[:page], per_page:  8)
---
SELECT  "posts".* FROM "posts" LIMIT 8 OFFSET 0